Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxHssl_reg.h
/** \brief D8, Access Window Start Register ${i} */
#define HSSL0_AW3_AWSTART /*lint --e(923)*/ (*(volatile Ifx_HSSL_AW_AWSTART*)0xF00800D8u)
/** Alias (User Manual Name) for HSSL0_AW3_AWSTART.
* To use register names with standard convension, please use HSSL0_AW3_AWSTART.
*/
#define HSSL0_AWSTART3 (HSSL0_AW3_AWSTART)

/** \brief DC, Access Window End Register ${i} */
#define HSSL0_AW3_AWEND /*lint --e(923)*/ (*(volatile Ifx_HSSL_AW_AWEND*)0xF00800DCu)
/** Alias (User Manual Name) for HSSL0_AW3_AWEND.
* To use register names with standard convension, please use HSSL0_AW3_AWEND.
*/
#define HSSL0_AWEND3 (HSSL0_AW3_AWEND)

/** \brief E0, Access Rules Register */
#define HSSL0_AR /*lint --e(923)*/ (*(volatile Ifx_HSSL_AR*)0xF00800E0u)

/** \brief E8, OCDS Control and Status */
#define HSSL0_OCS /*lint --e(923)*/ (*(volatile Ifx_HSSL_OCS*)0xF00800E8u)

/** \brief EC, Kernel Reset Status Clear Register */
#define HSSL0_KRSTCLR /*lint --e(923)*/ (*(volatile Ifx_HSSL_KRSTCLR*)0xF00800ECu)

/** \brief F0, Kernel Reset Register 1 */
#define HSSL0_KRST1 /*lint --e(923)*/ (*(volatile Ifx_HSSL_KRST1*)0xF00800F0u)

/** \brief F4, Kernel Reset Register 0 */
#define HSSL0_KRST0 /*lint --e(923)*/ (*(volatile Ifx_HSSL_KRST0*)0xF00800F4u)

/** \brief F8, Access Enable Register 1 */
#define HSSL0_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_HSSL_ACCEN1*)0xF00800F8u)

/** \brief FC, Access Enable Register 0 */
#define HSSL0_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_HSSL_ACCEN0*)0xF00800FCu)

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Hssl_Cfg_Hssl1
 * \{  */
/** \brief 0, Clock Control Register */
#define HSSL1_CLC /*lint --e(923)*/ (*(volatile Ifx_HSSL_CLC*)0xF00A0000u)

/** \brief 8, Module Identification Register */
#define HSSL1_ID /*lint --e(923)*/ (*(volatile Ifx_HSSL_ID*)0xF00A0008u)

/** \brief C, CRC Control Register */
#define HSSL1_CRC /*lint --e(923)*/ (*(volatile Ifx_HSSL_CRC*)0xF00A000Cu)

/** \brief 10, Configuration Register */
#define HSSL1_CFG /*lint --e(923)*/ (*(volatile Ifx_HSSL_CFG*)0xF00A0010u)

/** \brief 14, Request Flags Register */
#define HSSL1_QFLAGS /*lint --e(923)*/ (*(volatile Ifx_HSSL_QFLAGS*)0xF00A0014u)

/** \brief 18, Miscellaneous Flags Register */
#define HSSL1_MFLAGS /*lint --e(923)*/ (*(volatile Ifx_HSSL_MFLAGS*)0xF00A0018u)

/** \brief 1C, Miscellaneous Flags Set Register */
#define HSSL1_MFLAGSSET /*lint --e(923)*/ (*(volatile Ifx_HSSL_MFLAGSSET*)0xF00A001Cu)

/** \brief 20, Miscellaneous Flags Clear Register */
#define HSSL1_MFLAGSCL /*lint --e(923)*/ (*(volatile Ifx_HSSL_MFLAGSCL*)0xF00A0020u)

/** \brief 24, Flags Enable Register */
#define HSSL1_MFLAGSEN /*lint --e(923)*/ (*(volatile Ifx_HSSL_MFLAGSEN*)0xF00A0024u)

/** \brief 28, Stream FIFOs Status Flags Register */
#define HSSL1_SFSFLAGS /*lint --e(923)*/ (*(volatile Ifx_HSSL_SFSFLAGS*)0xF00A0028u)

/** \brief 30, Initiator Write Data Register ${i} */
#define HSSL1_I0_IWD /*lint --e(923)*/ (*(volatile Ifx_HSSL_I_IWD*)0xF00A0030u)
/** Alias (User Manual Name) for HSSL1_I0_IWD.
* To use register names with standard convension, please use HSSL1_I0_IWD.
*/
#define HSSL1_IWD0 (HSSL1_I0_IWD)

/** \brief 34, Initiator Control Data Register ${i} */
#define HSSL1_I0_ICON /*lint --e(923)*/ (*(volatile Ifx_HSSL_I_ICON*)0xF00A0034u)
/** Alias (User Manual Name) for HSSL1_I0_ICON.
* To use register names with standard convension, please use HSSL1_I0_ICON.
*/
#define HSSL1_ICON0 (HSSL1_I0_ICON)

/** \brief 38, Initiator Read Write Address Register */
#define HSSL1_I0_IRWA /*lint --e(923)*/ (*(volatile Ifx_HSSL_I_IRWA*)0xF00A0038u)
/** Alias (User Manual Name) for HSSL1_I0_IRWA.
* To use register names with standard convension, please use HSSL1_I0_IRWA.
*/
#define HSSL1_IRWA0 (HSSL1_I0_IRWA)

/** \brief 3C, Initiator Read Data Register */
#define HSSL1_I0_IRD /*lint --e(923)*/ (*(volatile Ifx_HSSL_I_IRD*)0xF00A003Cu)
/** Alias (User Manual Name) for HSSL1_I0_IRD.
* To use register names with standard convension, please use HSSL1_I0_IRD.
*/
#define HSSL1_IRD0 (HSSL1_I0_IRD)

/** \brief 40, Initiator Write Data Register ${i} */
#define HSSL1_I1_IWD /*lint --e(923)*/ (*(volatile Ifx_HSSL_I_IWD*)0xF00A0040u)
/** Alias (User Manual Name) for HSSL1_I1_IWD.
* To use register names with standard convension, please use HSSL1_I1_IWD.
*/
#define HSSL1_IWD1 (HSSL1_I1_IWD)

/** \brief 44, Initiator Control Data Register ${i} */
#define HSSL1_I1_ICON /*lint --e(923)*/ (*(volatile Ifx_HSSL_I_ICON*)0xF00A0044u)
/** Alias (User Manual Name) for HSSL1_I1_ICON.
* To use register names with standard convension, please use HSSL1_I1_ICON.
*/
#define HSSL1_ICON1 (HSSL1_I1_ICON)

/** \brief 48, Initiator Read Write Address Register */
#define HSSL1_I1_IRWA /*lint --e(923)*/ (*(volatile Ifx_HSSL_I_IRWA*)0xF00A0048u)
/** Alias (User Manual Name) for HSSL1_I1_IRWA.
* To use register names with standard convension, please use HSSL1_I1_IRWA.
*/
#define HSSL1_IRWA1 (HSSL1_I1_IRWA)

/** \brief 4C, Initiator Read Data Register */
#define HSSL1_I1_IRD /*lint --e(923)*/ (*(volatile Ifx_HSSL_I_IRD*)0xF00A004Cu)
/** Alias (User Manual Name) for HSSL1_I1_IRD.
* To use register names with standard convension, please use HSSL1_I1_IRD.
*/
#define HSSL1_IRD1 (HSSL1_I1_IRD)

/** \brief 50, Initiator Write Data Register ${i} */
#define HSSL1_I2_IWD /*lint --e(923)*/ (*(volatile Ifx_HSSL_I_IWD*)0xF00A0050u)
/** Alias (User Manual Name) for HSSL1_I2_IWD.
* To use register names with standard convension, please use HSSL1_I2_IWD.
*/
#define HSSL1_IWD2 (HSSL1_I2_IWD)

/** \brief 54, Initiator Control Data Register ${i} */
#define HSSL1_I2_ICON /*lint --e(923)*/ (*(volatile Ifx_HSSL_I_ICON*)0xF00A0054u)
/** Alias (User Manual Name) for HSSL1_I2_ICON.
* To use register names with standard convension, please use HSSL1_I2_ICON.
*/
#define HSSL1_ICON2 (HSSL1_I2_ICON)

/** \brief 58, Initiator Read Write Address Register */
#define HSSL1_I2_IRWA /*lint --e(923)*/ (*(volatile Ifx_HSSL_I_IRWA*)0xF00A0058u)
/** Alias (User Manual Name) for HSSL1_I2_IRWA.
* To use register names with standard convension, please use HSSL1_I2_IRWA.
*/
#define HSSL1_IRWA2 (HSSL1_I2_IRWA)

/** \brief 5C, Initiator Read Data Register */
#define HSSL1_I2_IRD /*lint --e(923)*/ (*(volatile Ifx_HSSL_I_IRD*)0xF00A005Cu)
/** Alias (User Manual Name) for HSSL1_I2_IRD.
* To use register names with standard convension, please use HSSL1_I2_IRD.
*/
#define HSSL1_IRD2 (HSSL1_I2_IRD)

/** \brief 60, Initiator Write Data Register ${i} */
#define HSSL1_I3_IWD /*lint --e(923)*/ (*(volatile Ifx_HSSL_I_IWD*)0xF00A0060u)
/** Alias (User Manual Name) for HSSL1_I3_IWD.
* To use register names with standard convension, please use HSSL1_I3_IWD.
*/
#define HSSL1_IWD3 (HSSL1_I3_IWD)

/** \brief 64, Initiator Control Data Register ${i} */
#define HSSL1_I3_ICON /*lint --e(923)*/ (*(volatile Ifx_HSSL_I_ICON*)0xF00A0064u)
/** Alias (User Manual Name) for HSSL1_I3_ICON.
* To use register names with standard convension, please use HSSL1_I3_ICON.
*/
#define HSSL1_ICON3 (HSSL1_I3_ICON)

/** \brief 68, Initiator Read Write Address Register */
#define HSSL1_I3_IRWA /*lint --e(923)*/ (*(volatile Ifx_HSSL_I_IRWA*)0xF00A0068u)
/** Alias (User Manual Name) for HSSL1_I3_IRWA.
* To use register names with standard convension, please use HSSL1_I3_IRWA.
*/
#define HSSL1_IRWA3 (HSSL1_I3_IRWA)

/** \brief 6C, Initiator Read Data Register */
#define HSSL1_I3_IRD /*lint --e(923)*/ (*(volatile Ifx_HSSL_I_IRD*)0xF00A006Cu)
/** Alias (User Manual Name) for HSSL1_I3_IRD.
* To use register names with standard convension, please use HSSL1_I3_IRD.
*/
#define HSSL1_IRD3 (HSSL1_I3_IRD)

