Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxHssl_reg.h
/** \brief 70, Target Current Data Register ${i} */
#define HSSL1_T0_TCD /*lint --e(923)*/ (*(volatile Ifx_HSSL_T_TCD*)0xF00A0070u)
/** Alias (User Manual Name) for HSSL1_T0_TCD.
* To use register names with standard convension, please use HSSL1_T0_TCD.
*/
#define HSSL1_TCD0 (HSSL1_T0_TCD)

/** \brief 74, Target Current Address Register ${i} */
#define HSSL1_T0_TCA /*lint --e(923)*/ (*(volatile Ifx_HSSL_T_TCA*)0xF00A0074u)
/** Alias (User Manual Name) for HSSL1_T0_TCA.
* To use register names with standard convension, please use HSSL1_T0_TCA.
*/
#define HSSL1_TCA0 (HSSL1_T0_TCA)

/** \brief 78, Target Current Data Register ${i} */
#define HSSL1_T1_TCD /*lint --e(923)*/ (*(volatile Ifx_HSSL_T_TCD*)0xF00A0078u)
/** Alias (User Manual Name) for HSSL1_T1_TCD.
* To use register names with standard convension, please use HSSL1_T1_TCD.
*/
#define HSSL1_TCD1 (HSSL1_T1_TCD)

/** \brief 7C, Target Current Address Register ${i} */
#define HSSL1_T1_TCA /*lint --e(923)*/ (*(volatile Ifx_HSSL_T_TCA*)0xF00A007Cu)
/** Alias (User Manual Name) for HSSL1_T1_TCA.
* To use register names with standard convension, please use HSSL1_T1_TCA.
*/
#define HSSL1_TCA1 (HSSL1_T1_TCA)

/** \brief 80, Target Current Data Register ${i} */
#define HSSL1_T2_TCD /*lint --e(923)*/ (*(volatile Ifx_HSSL_T_TCD*)0xF00A0080u)
/** Alias (User Manual Name) for HSSL1_T2_TCD.
* To use register names with standard convension, please use HSSL1_T2_TCD.
*/
#define HSSL1_TCD2 (HSSL1_T2_TCD)

/** \brief 84, Target Current Address Register ${i} */
#define HSSL1_T2_TCA /*lint --e(923)*/ (*(volatile Ifx_HSSL_T_TCA*)0xF00A0084u)
/** Alias (User Manual Name) for HSSL1_T2_TCA.
* To use register names with standard convension, please use HSSL1_T2_TCA.
*/
#define HSSL1_TCA2 (HSSL1_T2_TCA)

/** \brief 88, Target Current Data Register ${i} */
#define HSSL1_T3_TCD /*lint --e(923)*/ (*(volatile Ifx_HSSL_T_TCD*)0xF00A0088u)
/** Alias (User Manual Name) for HSSL1_T3_TCD.
* To use register names with standard convension, please use HSSL1_T3_TCD.
*/
#define HSSL1_TCD3 (HSSL1_T3_TCD)

/** \brief 8C, Target Current Address Register ${i} */
#define HSSL1_T3_TCA /*lint --e(923)*/ (*(volatile Ifx_HSSL_T_TCA*)0xF00A008Cu)
/** Alias (User Manual Name) for HSSL1_T3_TCA.
* To use register names with standard convension, please use HSSL1_T3_TCA.
*/
#define HSSL1_TCA3 (HSSL1_T3_TCA)

/** \brief 90, Target Status Register */
#define HSSL1_TSTAT /*lint --e(923)*/ (*(volatile Ifx_HSSL_TSTAT*)0xF00A0090u)

/** \brief 94, Target ID Address Register */
#define HSSL1_TIDADD /*lint --e(923)*/ (*(volatile Ifx_HSSL_TIDADD*)0xF00A0094u)

/** \brief 98, Security Control Register */
#define HSSL1_SEC /*lint --e(923)*/ (*(volatile Ifx_HSSL_SEC*)0xF00A0098u)

/** \brief 9C, Multi Slave Control Register */
#define HSSL1_MSCR /*lint --e(923)*/ (*(volatile Ifx_HSSL_MSCR*)0xF00A009Cu)

/** \brief A0, Initiator Stream Start Address Register */
#define HSSL1_IS_SA0 /*lint --e(923)*/ (*(volatile Ifx_HSSL_IS_SA*)0xF00A00A0u)
/** Alias (User Manual Name) for HSSL1_IS_SA0.
* To use register names with standard convension, please use HSSL1_IS_SA0.
*/
#define HSSL1_ISSA0 (HSSL1_IS_SA0)

/** \brief A4, Initiator Stream Start Address Register */
#define HSSL1_IS_SA1 /*lint --e(923)*/ (*(volatile Ifx_HSSL_IS_SA*)0xF00A00A4u)
/** Alias (User Manual Name) for HSSL1_IS_SA1.
* To use register names with standard convension, please use HSSL1_IS_SA1.
*/
#define HSSL1_ISSA1 (HSSL1_IS_SA1)

/** \brief A8, Initiator Stream Current Address Register */
#define HSSL1_IS_CA /*lint --e(923)*/ (*(volatile Ifx_HSSL_IS_CA*)0xF00A00A8u)

/** \brief AC, Initiator Stream Frame Count Register */
#define HSSL1_IS_FC /*lint --e(923)*/ (*(volatile Ifx_HSSL_IS_FC*)0xF00A00ACu)

/** \brief B0, Target Stream Start Address Register ${x} */
#define HSSL1_TS_SA0 /*lint --e(923)*/ (*(volatile Ifx_HSSL_TS_SA*)0xF00A00B0u)
/** Alias (User Manual Name) for HSSL1_TS_SA0.
* To use register names with standard convension, please use HSSL1_TS_SA0.
*/
#define HSSL1_TSSA0 (HSSL1_TS_SA0)

/** \brief B4, Target Stream Start Address Register ${x} */
#define HSSL1_TS_SA1 /*lint --e(923)*/ (*(volatile Ifx_HSSL_TS_SA*)0xF00A00B4u)
/** Alias (User Manual Name) for HSSL1_TS_SA1.
* To use register names with standard convension, please use HSSL1_TS_SA1.
*/
#define HSSL1_TSSA1 (HSSL1_TS_SA1)

/** \brief B8, Target Stream Current Address Register */
#define HSSL1_TS_CA /*lint --e(923)*/ (*(volatile Ifx_HSSL_TS_CA*)0xF00A00B8u)

/** \brief BC, Target Stream Frame Count Register */
#define HSSL1_TS_FC /*lint --e(923)*/ (*(volatile Ifx_HSSL_TS_FC*)0xF00A00BCu)

/** \brief C0, Access Window Start Register ${i} */
#define HSSL1_AW0_AWSTART /*lint --e(923)*/ (*(volatile Ifx_HSSL_AW_AWSTART*)0xF00A00C0u)
/** Alias (User Manual Name) for HSSL1_AW0_AWSTART.
* To use register names with standard convension, please use HSSL1_AW0_AWSTART.
*/
#define HSSL1_AWSTART0 (HSSL1_AW0_AWSTART)

/** \brief C4, Access Window End Register ${i} */
#define HSSL1_AW0_AWEND /*lint --e(923)*/ (*(volatile Ifx_HSSL_AW_AWEND*)0xF00A00C4u)
/** Alias (User Manual Name) for HSSL1_AW0_AWEND.
* To use register names with standard convension, please use HSSL1_AW0_AWEND.
*/
#define HSSL1_AWEND0 (HSSL1_AW0_AWEND)

/** \brief C8, Access Window Start Register ${i} */
#define HSSL1_AW1_AWSTART /*lint --e(923)*/ (*(volatile Ifx_HSSL_AW_AWSTART*)0xF00A00C8u)
/** Alias (User Manual Name) for HSSL1_AW1_AWSTART.
* To use register names with standard convension, please use HSSL1_AW1_AWSTART.
*/
#define HSSL1_AWSTART1 (HSSL1_AW1_AWSTART)

/** \brief CC, Access Window End Register ${i} */
#define HSSL1_AW1_AWEND /*lint --e(923)*/ (*(volatile Ifx_HSSL_AW_AWEND*)0xF00A00CCu)
/** Alias (User Manual Name) for HSSL1_AW1_AWEND.
* To use register names with standard convension, please use HSSL1_AW1_AWEND.
*/
#define HSSL1_AWEND1 (HSSL1_AW1_AWEND)

/** \brief D0, Access Window Start Register ${i} */
#define HSSL1_AW2_AWSTART /*lint --e(923)*/ (*(volatile Ifx_HSSL_AW_AWSTART*)0xF00A00D0u)
/** Alias (User Manual Name) for HSSL1_AW2_AWSTART.
* To use register names with standard convension, please use HSSL1_AW2_AWSTART.
*/
#define HSSL1_AWSTART2 (HSSL1_AW2_AWSTART)

/** \brief D4, Access Window End Register ${i} */
#define HSSL1_AW2_AWEND /*lint --e(923)*/ (*(volatile Ifx_HSSL_AW_AWEND*)0xF00A00D4u)
/** Alias (User Manual Name) for HSSL1_AW2_AWEND.
* To use register names with standard convension, please use HSSL1_AW2_AWEND.
*/
#define HSSL1_AWEND2 (HSSL1_AW2_AWEND)

