Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxHssl_reg.h
/** \brief D8, Access Window Start Register ${i} */
#define HSSL1_AW3_AWSTART /*lint --e(923)*/ (*(volatile Ifx_HSSL_AW_AWSTART*)0xF00A00D8u)
/** Alias (User Manual Name) for HSSL1_AW3_AWSTART.
* To use register names with standard convension, please use HSSL1_AW3_AWSTART.
*/
#define HSSL1_AWSTART3 (HSSL1_AW3_AWSTART)

/** \brief DC, Access Window End Register ${i} */
#define HSSL1_AW3_AWEND /*lint --e(923)*/ (*(volatile Ifx_HSSL_AW_AWEND*)0xF00A00DCu)
/** Alias (User Manual Name) for HSSL1_AW3_AWEND.
* To use register names with standard convension, please use HSSL1_AW3_AWEND.
*/
#define HSSL1_AWEND3 (HSSL1_AW3_AWEND)

/** \brief E0, Access Rules Register */
#define HSSL1_AR /*lint --e(923)*/ (*(volatile Ifx_HSSL_AR*)0xF00A00E0u)

/** \brief E8, OCDS Control and Status */
#define HSSL1_OCS /*lint --e(923)*/ (*(volatile Ifx_HSSL_OCS*)0xF00A00E8u)

/** \brief EC, Kernel Reset Status Clear Register */
#define HSSL1_KRSTCLR /*lint --e(923)*/ (*(volatile Ifx_HSSL_KRSTCLR*)0xF00A00ECu)

/** \brief F0, Kernel Reset Register 1 */
#define HSSL1_KRST1 /*lint --e(923)*/ (*(volatile Ifx_HSSL_KRST1*)0xF00A00F0u)

/** \brief F4, Kernel Reset Register 0 */
#define HSSL1_KRST0 /*lint --e(923)*/ (*(volatile Ifx_HSSL_KRST0*)0xF00A00F4u)

/** \brief F8, Access Enable Register 1 */
#define HSSL1_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_HSSL_ACCEN1*)0xF00A00F8u)

/** \brief FC, Access Enable Register 0 */
#define HSSL1_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_HSSL_ACCEN0*)0xF00A00FCu)

/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXHSSL_REG_H */
